tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/rtos/FreeRTOS/Source/portable/riscv32/port.c
#if( configASSERT_DEFINED == 1 )
    {
        /* Use the same mask on the maximum system call priority. */
        ucMaxSysCallPriority = prvCheckMaxSysCallPrio(configMAX_SYSCALL_INTERRUPT_PRIORITY);
        FREERTOS_PORT_DEBUG("Max SysCall Priority is set to %d\n", ucMaxSysCallPriority);
    }
#endif /* conifgASSERT_DEFINED */

    __disable_irq();
    /* Start the timer that generates the tick ISR.  Interrupts are disabled
    here already. */
    vPortSetupTimerInterrupt();

    /* Initialise the critical nesting count ready for the first task. */
    uxCriticalNesting = 0;

    /* Start the first task. */
    prvPortStartFirstTask();

    /* Should never get here as the tasks will now be executing!  Call the task
    exit error function to prevent compiler warnings about a static function
    not being called in the case that the application writer overrides this
    functionality by defining configTASK_RETURN_ADDRESS.  Call
    vTaskSwitchContext() so link time optimisation does not remove the
    symbol. */
    vTaskSwitchContext();
    prvTaskExitError();

    /* Should not get here! */
    return 0;
}
/*-----------------------------------------------------------*/

void vPortEndScheduler(void)
{
    /* Not implemented in ports where there is nothing to return to.
    Artificially force an assert. */
    configASSERT(uxCriticalNesting == 1000UL);
}
/*-----------------------------------------------------------*/

void vPortEnterCritical(void)
{
    portDISABLE_INTERRUPTS();
    uxCriticalNesting++;

    /* This is not the interrupt safe version of the enter critical function so
    assert() if it is being called from an interrupt context.  Only API
    functions that end in "FromISR" can be used in an interrupt.  Only assert if
    the critical nesting count is 1 to protect against recursive calls if the
    assert function also uses a critical section. */
    if (uxCriticalNesting == 1) {
        configASSERT((__ECLIC_GetMth() & portMTH_MASK) == uxMaxSysCallMTH);
    }
}
/*-----------------------------------------------------------*/

void vPortExitCritical(void)
{
    configASSERT(uxCriticalNesting);
    uxCriticalNesting--;
    if (uxCriticalNesting == 0) {
        portENABLE_INTERRUPTS();
    }
}

uint32_t vPortInCritical(void)
{
    return uxCriticalNesting;
}

/*-----------------------------------------------------------*/

void vPortAssert(int32_t x)
{
    if ((x) == 0) {
        taskDISABLE_INTERRUPTS();
#if (INCLUDE_xTaskGetCurrentTaskHandle == 1)
        TaskHandle_t th = xTaskGetCurrentTaskHandle();
        if (th) {
            printf("Assert in task %s\n", pcTaskGetName(th));
        }
#endif
        while (1) {
            /* Sleep and wait for interrupt */
            __WFI();
        };
    }
}
/*-----------------------------------------------------------*/


void xPortTaskSwitch(void)
{
    portDISABLE_INTERRUPTS();
    /* Clear Software IRQ, A MUST */
    SysTimer_ClearSWIRQ();
    vTaskSwitchContext();
    portENABLE_INTERRUPTS();
}
/*-----------------------------------------------------------*/

#if( configUSE_TICKLESS_IDLE == 1 )
extern void systick_lock_release(void);
extern void systick_lock_acquire(void);
#endif

void xPortSysTickHandler(void)
{
    // Reload maybe preempted by other higher interrupt
    __disable_irq();
    SysTick_Reload(SYSTICK_TICK_CONST);
    __enable_irq();

    /* The SysTick runs at the lowest interrupt priority, so when this interrupt
    executes all interrupts must be unmasked.  There is therefore no need to
    save and then restore the interrupt mask value as its value is already
    known. */
    portDISABLE_INTERRUPTS();
    {
#if( configUSE_TICKLESS_IDLE == 1 )
        systick_lock_release();
#endif
        /* Increment the RTOS tick. */
        if (xTaskIncrementTick() != pdFALSE) {
            /* A context switch is required.  Context switching is performed in
            the SWI interrupt.  Pend the SWI interrupt. */
            portYIELD();
        }
    }
    portENABLE_INTERRUPTS();
}
/*-----------------------------------------------------------*/

#if( configUSE_TICKLESS_IDLE == 1 )

__attribute__((weak)) void vPortSuppressTicksAndSleep(TickType_t xExpectedIdleTime)
{
    uint32_t ulReloadValue, ulCompleteTickPeriods, ulCompletedSysTickDecrements;
    volatile TickType_t xModifiableIdleTime, XLastLoadValue, XLastCmpValue;

    FREERTOS_PORT_DEBUG("Enter TickLess %d\n", (uint32_t)xExpectedIdleTime);

    /* Make sure the SysTick reload value does not overflow the counter. */
    if (xExpectedIdleTime > xMaximumPossibleSuppressedTicks) {
        xExpectedIdleTime = xMaximumPossibleSuppressedTicks;
    }

    /* Enter a critical section but don't use the taskENTER_CRITICAL()
    method as that will mask interrupts that should exit sleep mode. */
    __disable_irq();

    /* If a context switch is pending or a task is waiting for the scheduler
    to be unsuspended then abandon the low power entry. */
    if (eTaskConfirmSleepModeStatus() == eAbortSleep || !freertos_ready_to_sleep()) {
        /* Restart from whatever is left in the count register to complete
        this tick period. */
        /* Restart SysTick. */
        //SysTimer_Start();

        // GD32VW55X, it will cause lost ticks too much as 1:4000 if reload tick here
        /* Reset the reload register to the value required for normal tick
           periods. */
        // SysTick_Reload(ulTimerCountsForOneTick);

        /* Re-enable interrupts - see comments above the cpsid instruction()
           above. */
        __enable_irq();
    } else {
        /* Stop the SysTick momentarily.  The time the SysTick is stopped for
        is accounted for as best it can be, but using the tickless mode will
        inevitably result in some tiny drift of the time maintained by the
        kernel with respect to calendar time. */
        SysTimer_Stop();

        /* Calculate the reload value required to wait xExpectedIdleTime
        tick periods.  -1 is used because this code will execute part way
        through one of the tick periods. */
        ulReloadValue = (ulTimerCountsForOneTick * (xExpectedIdleTime - 1UL));
        if (ulReloadValue > ulStoppedTimerCompensation) {
            ulReloadValue -= ulStoppedTimerCompensation;
        }

        /* Get System timer load value before sleep */
        XLastLoadValue = SysTimer_GetLoadValue();
        XLastCmpValue = SysTimer_GetCompareValue();
        if (XLastCmpValue > XLastLoadValue) {
            ulReloadValue += XLastCmpValue - XLastLoadValue;
        }

        /* Set the new reload value. */
        SysTick_Reload(ulReloadValue);

        /* Restart SysTick. */
        SysTimer_Start();
        ECLIC_EnableIRQ(CLIC_INT_TMR);
        __RWMB();

        /* Sleep until something happens.  configPRE_SLEEP_PROCESSING() can
        set its parameter to 0 to indicate that its implementation contains
        its own wait for interrupt or wait for event instruction, and so wfi
        should not be executed again.  However, the original expected idle
        time variable must remain unmodified, so a copy is taken. */
        xModifiableIdleTime = xExpectedIdleTime;
        configPRE_SLEEP_PROCESSING(xModifiableIdleTime);
        if (xModifiableIdleTime > 0) {
            __WFI();
        } else {
            // GD32VW55X
            /* Get System timer load value if CPU enter deep sleep once */
            XLastLoadValue = SysTimer_GetLoadValue();
        }
        configPOST_SLEEP_PROCESSING(xExpectedIdleTime);

        // GD32VW55X, it do not need do follow step if CPU enter deep sleep once
        if (xModifiableIdleTime > 0) {
            /* Re-enable interrupts to allow the interrupt that brought the MCU
            out of sleep mode to execute immediately. */
            __enable_irq();

            /* Make sure interrupt enable is executed */
            __RWMB();
            __FENCE_I();
            __NOP();

            /* Disable interrupts again because the clock is about to be stopped
                and interrupts that execute while the clock is stopped will increase
                any slippage between the time maintained by the RTOS and calendar
                time. */
            __disable_irq();
        }

