tuya/TuyaOpen-GigaDevice/gd32_os/MSDK/rtos/FreeRTOS/Source/portable/riscv32/port.c
        /* Disable the SysTick clock.  Again,
           the time the SysTick is stopped for is accounted for as best it can
           be, but using the tickless mode will inevitably result in some tiny
           drift of the time maintained by the kernel with respect to calendar
           time*/
        ECLIC_DisableIRQ(CLIC_INT_TMR);

        /* Determine if SysTimer Interrupt is not yet happened,
        (in which case an interrupt other than the SysTick
        must have brought the system out of sleep mode). */
        if (SysTimer_GetLoadValue() >= (XLastLoadValue + ulReloadValue)) {
            /* As the pending tick will be processed as soon as this
            function exits, the tick value maintained by the tick is stepped
            forward by one less than the time spent waiting. */
            ulCompleteTickPeriods = xExpectedIdleTime - 1UL;
            FREERTOS_PORT_DEBUG("TickLess - SysTimer Interrupt Entered!\n");
        } else {
            /* Something other than the tick interrupt ended the sleep.
            Work out how long the sleep lasted rounded to complete tick
            periods (not the ulReload value which accounted for part
            ticks). */
            xModifiableIdleTime = SysTimer_GetLoadValue();
            if (xModifiableIdleTime > XLastLoadValue) {
                ulCompletedSysTickDecrements = (xModifiableIdleTime - XLastLoadValue);
            } else {
                ulCompletedSysTickDecrements = (xModifiableIdleTime + portMAX_BIT_NUMBER - XLastLoadValue);
            }

            /* How many complete tick periods passed while the processor
            was waiting? */
            ulCompleteTickPeriods = ulCompletedSysTickDecrements / ulTimerCountsForOneTick;

            /* The reload value is set to whatever fraction of a single tick
            period remains. */
            SysTick_Reload(ulTimerCountsForOneTick);
            FREERTOS_PORT_DEBUG("TickLess - External Interrupt Happened!\n");
        }

        FREERTOS_PORT_DEBUG("End TickLess %d\n", (uint32_t)ulCompleteTickPeriods);

        /* Restart SysTick */
        vTaskStepTick(ulCompleteTickPeriods);

        /* Exit with interrupts enabled. */
        ECLIC_EnableIRQ(CLIC_INT_TMR);
        systick_lock_acquire();
        __enable_irq();
    }
}


#endif /* #if configUSE_TICKLESS_IDLE */
/*-----------------------------------------------------------*/

/*
 * Setup the systick timer to generate the tick interrupts at the required
 * frequency.
 */
__attribute__((weak)) void vPortSetupTimerInterrupt(void)
{
    /* Calculate the constants required to configure the tick interrupt. */
#if( configUSE_TICKLESS_IDLE == 1 )
    {
        ulTimerCountsForOneTick = (SYSTICK_TICK_CONST);
        xMaximumPossibleSuppressedTicks = 0xFFFFFFFFUL / ulTimerCountsForOneTick;
        ulStoppedTimerCompensation = portMISSED_COUNTS_FACTOR / (configCPU_CLOCK_HZ / configSYSTICK_CLOCK_HZ);
        FREERTOS_PORT_DEBUG("CountsForOneTick, SuppressedTicks and TimerCompensation: %u, %u, %u\n", \
                            (uint32_t)ulTimerCountsForOneTick, (uint32_t)xMaximumPossibleSuppressedTicks, (uint32_t)ulStoppedTimerCompensation);
    }
#endif /* configUSE_TICKLESS_IDLE */
    TickType_t ticks = SYSTICK_TICK_CONST;

    /* Make SWI and SysTick the lowest priority interrupts. */
    /* Stop and clear the SysTimer. SysTimer as Non-Vector Interrupt */
    SysTick_Config(ticks);
    ECLIC_DisableIRQ(CLIC_INT_TMR);
    ECLIC_SetLevelIRQ(CLIC_INT_TMR, configKERNEL_INTERRUPT_PRIORITY);
    ECLIC_SetShvIRQ(CLIC_INT_TMR, 0);
    ECLIC_EnableIRQ(CLIC_INT_TMR);

    /* Set SWI interrupt level to lowest level/priority, SysTimerSW as Vector Interrupt */
    ECLIC_SetShvIRQ(CLIC_INT_SFT, 1);
    ECLIC_SetLevelIRQ(CLIC_INT_SFT, configKERNEL_INTERRUPT_PRIORITY);
    ECLIC_EnableIRQ(CLIC_INT_SFT);
}
/*-----------------------------------------------------------*/

/*-----------------------------------------------------------*/

#if( configASSERT_DEFINED == 1 )

void vPortValidateInterruptPriority(void)
{
    uint8_t ucCurrentPriority;

    CSR_MSUBM_Type msubm = (CSR_MSUBM_Type)__RV_CSR_READ(CSR_MSUBM);
    /* Make sure current trap type is interrupt */
    configASSERT(msubm.b.typ == 1);
    if (msubm.b.typ) {
        /* Get the interrupt's priority. */
        ucCurrentPriority = (__RV_CSR_READ(CSR_MINTSTATUS) >> 24) >> (ECLIC_MAX_NLBITS - __ECLIC_GetCfgNlbits());
        /* The following assertion will fail if a service routine (ISR) for
        an interrupt that has been assigned a priority above
        ucMaxSysCallPriority calls an ISR safe FreeRTOS API
        function.  ISR safe FreeRTOS API functions must *only* be called
        from interrupts that have been assigned a priority at or below
        ucMaxSysCallPriority.

        Numerically low interrupt priority numbers represent logically high
        interrupt priorities, therefore the priority of the interrupt must
        be set to a value equal to or numerically *higher* than
        ucMaxSysCallPriority.

        Interrupts that use the FreeRTOS API must not be left at their
        default priority of zero as that is the highest possible priority,
        which is guaranteed to be above ucMaxSysCallPriority,
        and therefore also guaranteed to be invalid.

        FreeRTOS maintains separate thread and ISR API functions to ensure
        interrupt entry is as fast and simple as possible.

        The following links provide detailed information:
        http://www.freertos.org/FAQHelp.html */
        configASSERT(ucCurrentPriority <= ucMaxSysCallPriority);
    }
}

#endif /* configASSERT_DEFINED */

/*-----------------------------------------------------------*/
void vApplicationIdleHook( void )
{
    int64_t delta_tick;

    extern void trace_dma_print(void);
    trace_dma_print();

    /* Clock calibration is performed only when the clock drift is greater than
     * configEXPECTED_IDLE_TIME_BEFORE_SLEEP.
     * Compensate for a maximum of 5 ticks at least every second. */
    delta_tick = SysTimer_GetLoadValue() / ulTimerCountsForOneTick - xTaskGetTickCount();
    if ((delta_tick > configEXPECTED_IDLE_TIME_BEFORE_SLEEP) &&
        (xTaskGetTickCount() - ulLastCalibrationTick > 1000 * portTICK_PERIOD_MS)) {
        vTaskSuspendAll();
        portDISABLE_INTERRUPTS();
        delta_tick = SysTimer_GetLoadValue() / ulTimerCountsForOneTick - xTaskGetTickCount();
        if (delta_tick > configEXPECTED_IDLE_TIME_BEFORE_SLEEP) {
            vTaskStepTickExt(configEXPECTED_IDLE_TIME_BEFORE_SLEEP);
            ulLastCalibrationTick = xTaskGetTickCount();
        }
        portENABLE_INTERRUPTS();
        ( void ) xTaskResumeAll();

    }
}

#include <stdio.h>
void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
{
    printf("\n\rError: STACK OVERFLOW, TaskName: %s\n\r", pcTaskName);

    for (; ;);
}

/*-----------------------------------------------------------*/
